In [1]:
import pandas as pd

In [2]:
df_input = pd.read_pickle("netflix_prize.pkl")
df_mt = pd.read_csv("netflix-prize\movie_titles.csv", header=None, names=["movieID"])

In [3]:
df_input.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 5 columns):
 #   Column      Dtype
---  ------      -----
 0   index       int64
 1   userID      object
 2   rating      float64
 3   ratingDate  object
 4   movieID     object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.7+ GB

In [4]:
df_mt.head()

                               movieID
0               1;2003;Dinosaur Planet
1    2;2004;Isle of Man TT 2004 Review
2                     3;1997;Character
3  4;1994;Paula Abdul's Get Up & Dance
4      5;2004;The Rise and Fall of ECW

### Splitting the contents of 'movieID' column to get movie ID, its release year and the title

In [5]:
df_mt['movieID'] = df_mt['movieID'].apply(lambda x: list(x.split(";")))
df_mt["releaseYear"] = df_mt['movieID'].apply(lambda x: x[1])
df_mt["title"] = df_mt['movieID'].apply(lambda x: x[2])
df_mt["movieID"] = df_mt['movieID'].apply(lambda x: x[0])

In [6]:
## Get the content type from title (e.g. TV Shows have "Series" or "Season" the title)
df_mt['type'] = df_mt["title"].apply(lambda x: "tv show" if ": series " in x.lower() or ": season " in x.lower() else "movie")
df_mt['title'] = df_mt['title'].apply(lambda x: x[:x.lower().find(": s")] if ": series " in x.lower() or ": season " in x.lower() else x)
df_mt.head()

  movieID releaseYear                         title   type
0       1        2003               Dinosaur Planet  movie
1       2        2004    Isle of Man TT 2004 Review  movie
2       3        1997                     Character  movie
3       4        1994  Paula Abdul's Get Up & Dance  movie
4       5        2004      The Rise and Fall of ECW  movie

In [7]:
df_input.head()

   index   userID  rating  ratingDate movieID
0      1  1488844     3.0  2005-09-06       1
1      2   822109     5.0  2005-05-13       1
2      3   885013     4.0  2005-10-19       1
3      4    30878     4.0  2005-12-26       1
4      5   823519     3.0  2004-05-03       1

### Merge the imported datasets into one based on movieID

In [8]:
df = df_input.merge(df_mt)
df.drop('index', axis = 1, inplace=True)

In [9]:
df.head()

    userID  rating  ratingDate movieID releaseYear            title   type
0  1488844     3.0  2005-09-06       1        2003  Dinosaur Planet  movie
1   822109     5.0  2005-05-13       1        2003  Dinosaur Planet  movie
2   885013     4.0  2005-10-19       1        2003  Dinosaur Planet  movie
3    30878     4.0  2005-12-26       1        2003  Dinosaur Planet  movie
4   823519     3.0  2004-05-03       1        2003  Dinosaur Planet  movie

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100480507 entries, 0 to 100480506
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   userID       object
 1   rating       float64
 2   ratingDate   object
 3   movieID      object
 4   releaseYear  object
 5   title        object
 6   type         object
dtypes: float64(1), object(6)
memory usage: 6.0+ GB

### How many NaN values in each column?

In [11]:
for column in df.columns:
    print("NaN sum in column:", column, "equals", df[column].isna().sum())

NaN sum in column: userID equals 0
NaN sum in column: rating equals 0
NaN sum in column: ratingDate equals 0
NaN sum in column: movieID equals 0
NaN sum in column: releaseYear equals 0
NaN sum in column: title equals 0
NaN sum in column: type equals 0

In [12]:
numeric_cols = ['userID', 'rating', 'movieID', 'releaseYear']

In [13]:
## Are all values in numeric columns numbers?

for column in numeric_cols:
    print("NaN sum in column when numeric:", column, "equals", pd.to_numeric(df[column], errors='coerce').isna().sum())

NaN sum in column when numeric: userID equals 0
NaN sum in column when numeric: rating equals 0
NaN sum in column when numeric: movieID equals 0
NaN sum in column when numeric: releaseYear equals 965

In [14]:
## Which rows contain non-numeric values in column 'releaseYear'?

year_index = list(df.loc[pd.isna(pd.to_numeric(df['releaseYear'], errors='coerce')), :].index)
len(year_index)

965

In [15]:
## Which titles miss the 'release year' information?

df.loc[year_index, 'title'].value_counts()

Ancient Civilizations: Athens and Greece       195
Ancient Civilizations: Rome and Pompeii        189
Jimmy Hollywood                                189
Eros Dance Dhamaka                             116
Ancient Civilizations: Land of the Pharaohs    113
Hote Hote Pyaar Ho Gaya                         88
Roti Kapada Aur Makaan                          75
Name: title, dtype: int64

In [16]:
df.loc[year_index, :].sample(n=10)

,userID,rating,ratingDate,movieID,releaseYear,title,type
23435022,1363135,3.0,2004-02-05,4388,NULL,Ancient Civilizations: Rome and Pompeii,movie
58726792,2219254,3.0,2003-07-16,10782,NULL,Roti Kapada Aur Makaan,movie
93991338,218030,1.0,2004-12-28,16678,NULL,Jimmy Hollywood,movie
89557137,1183475,1.0,2001-03-11,15918,NULL,Hote Hote Pyaar Ho Gaya,movie
89557151,2506048,2.0,2002-02-04,15918,NULL,Hote Hote Pyaar Ho Gaya,movie
93991449,2630107,3.0,2004-12-21,16678,NULL,Jimmy Hollywood,movie
100076018,2176303,4.0,2005-05-01,17667,NULL,Eros Dance Dhamaka,movie
25799141,828166,1.0,2004-10-07,4794,NULL,Ancient Civilizations: Land of the Pharaohs,movie
41121991,1678265,1.0,2002-08-17,7241,NULL,Ancient Civilizations: Athens and Greece,movie
89557157,2342834,4.0,2004-01-30,15918,NULL,Hote Hote Pyaar Ho Gaya,movie

In [17]:
## Get the titles of movies with NaN values

null_ids = df.loc[year_index, 'title'].value_counts()
null_ids = null_ids.reset_index()

In [18]:
## Set the release year value on Google-based information

df.loc[df.title == null_ids['index'].unique()[2], 'releaseYear'] = 1994
df.loc[df.title == null_ids['index'].unique()[3], 'releaseYear'] = 1999
df.loc[df.title == null_ids['index'].unique()[5], 'releaseYear'] = 1999
df.loc[df.title == null_ids['index'].unique()[6], 'releaseYear'] = 1974

In [19]:
## Set the release year based on the earliest rating date corresponding to the movie

df.ratingDate = pd.to_datetime(df['ratingDate'])

for movie in null_ids['index'].unique()[[0,1,4]]:
    df.loc[df.title == movie, 'releaseYear'] = min(df.loc[df['title'] == movie, 'ratingDate']).year

In [20]:
df.loc[year_index, :].sample(n=10)

,userID,rating,ratingDate,movieID,releaseYear,title,type
100076108,1534243,3.0,2004-02-23,17667,1999,Eros Dance Dhamaka,movie
41122135,2596706,3.0,2004-12-13,7241,2001,Ancient Civilizations: Athens and Greece,movie
25799195,1084999,3.0,2002-11-19,4794,2001,Ancient Civilizations: Land of the Pharaohs,movie
23435051,2101632,3.0,2003-11-04,4388,2001,Ancient Civilizations: Rome and Pompeii,movie
89557162,2498663,2.0,2005-08-02,15918,1999,Hote Hote Pyaar Ho Gaya,movie
93991403,1210199,3.0,2005-07-07,16678,1994,Jimmy Hollywood,movie
100076032,2520868,3.0,2005-02-01,17667,1999,Eros Dance Dhamaka,movie
25799141,828166,1.0,2004-10-07,4794,2001,Ancient Civilizations: Land of the Pharaohs,movie
41122048,2058045,1.0,2004-10-08,7241,2001,Ancient Civilizations: Athens and Greece,movie
58726851,20461,3.0,2005-03-28,10782,1974,Roti Kapada Aur Makaan,movie

### Save the cleaned data to pickle

In [21]:
df.to_pickle("input_data.pkl")